Revit 2017 API
Application Methods
The Application type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
NewAreaCreationData
Creates an object which wraps the arguments of Area for batch creation.
NewBoundingBoxUV()
Creates an empty two-dimensional rectangle.
NewBoundingBoxUV(Double, Double, Double, Double)
Creates a two-dimensional rectangle with supplied values.
NewBoundingBoxXYZ
Creates a three-dimensional rectangular box.
NewBuildingSiteExportOptions
Creates Building Site Export options.
NewCategorySet
Creates a new instance of a set specifically for holding category objects.
NewColor
Returns a new color object.
NewCombinableElementArray
Returns an array that can hold combinable element objects.
NewCurveArrArray
Creates an empty array that can store geometric curve loops.
NewCurveArray
Creates an empty array that can store geometric curves.
NewCurveLoopsProfile
Creates a new CurveLoopsProfile object.
NewDoubleArray
Creates a new instance of a double array.
NewDWFExportOptions
Creates DWF Export options.
NewDWFXExportOptions
Creates DWFX Export options.
NewElementId
Creates a new Autodesk::Revit::DB::ElementId^ object.
NewElementSet
Creates a new instance of a set specifically for holding elements.
NewFaceArray
Creates a new instance of a face array.
NewFamilyInstanceCreationData(FamilySymbol, IList<XYZ>)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
NewFamilyInstanceCreationData(Face, Line, FamilySymbol)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
NewFamilyInstanceCreationData(XYZ, FamilySymbol, StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
NewFamilyInstanceCreationData(Curve, FamilySymbol, Level, StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
NewFamilyInstanceCreationData(Face, XYZ, XYZ, FamilySymbol)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
NewFamilyInstanceCreationData(XYZ, FamilySymbol, Element, StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
NewFamilyInstanceCreationData(XYZ, FamilySymbol, Level, StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
NewFamilyInstanceCreationData(XYZ, FamilySymbol, Element, Level, StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
NewFamilyInstanceCreationData(XYZ, FamilySymbol, XYZ, Element, StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
NewFamilySymbolProfile
Creates a new FamilySymbolProfile object.
NewFBXExportOptions
Creates 3D-Studio Max (FBX) Export options.
NewGBXMLImportOptions
Creates Green-Building XML Import options.
NewGeometryOptions
Creates an object to specify user preferences in parsing of geometry.
NewImageImportOptions
Creates Image Import options.
NewInstanceBinding()
Creates a new empty instance binding object.
NewInstanceBinding(CategorySet)
Creates a new instance binding object containing the categories passed as a parameter.
NewIntersectionResultArray
Creates a new instance of an IntersectionResult array.
NewPlane(CurveArray) |  Obsolete.
 Creates a new geometric plane from a loop of planar curves.
NewPlane(XYZ, XYZ) |  Obsolete.
Creates a new geometric plane object based on a normal vector and an origin.
NewPlane(XYZ, XYZ, XYZ) |  Obsolete.
Creates a new geometric plane object based on two coordinate vectors and an origin.
NewPointOnEdge
Create a PointOnEdge object which is used to define the placement of a ReferencePoint.
NewPointOnEdgeEdgeIntersection
Construct a PointOnEdgeEdgeIntersection object which is used to define the placement of a ReferencePoint given two references to edge.
NewPointOnEdgeFaceIntersection
Construct a PointOnEdgeFaceIntersection object which is used to define the placement of a ReferencePoint given a references to edge and a reference to face.
NewPointOnFace
Construct a PointOnFace object which is used to define the placement of a ReferencePoint given a reference and a location on the face.
NewPointOnPlane
Construct a PointOnPlane object which is used to define the placement of a ReferencePoint from its property values.
NewPointRelativeToPoint
Create a PointRelativeToPoint object, which is used to define the placement of a ReferencePoint relative to a host point.
NewProjectPosition
Creates a new project position object.
NewReferenceArray
Creates a new instance of a reference array.
NewReferencePointArray
Creates an empty array that can store ReferencePoint objects.
NewSpaceSet
Creates a new instance of a space set.
NewTypeBinding()
Creates a new empty type binding object.
NewTypeBinding(CategorySet)
Creates a new type binding object containing the categories passed as a parameter.
NewUV()
Creates a UV object at the origin.
NewUV(UV)
Creates a UV object by copying the supplied UV object.
NewUV(Double, Double)
Creates a UV object representing coordinates in 2-space with supplied values.
NewVertexIndexPair
Creates a new VertexIndexPair object.
NewVertexIndexPairArray
Returns an array that can hold VertexIndexPair objects.
NewViewSet
Creates a new instance of a View set.
NewXYZ()
Creates a XYZ object at the origin.
NewXYZ(XYZ)
Creates a XYZ object by copying the supplied XYZ object.
NewXYZ(Double, Double, Double)
Creates a XYZ object representing coordinates in 3-space with supplied values.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Application Class
Autodesk.Revit.Creation Namespace